## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/14743379320)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 4 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * module.docker_cache.google_artifact_registry_repository.artifact_registry
  * module.docker_cache.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"]
  * module.dockerhub_mirror.google_artifact_registry_repository.artifact_registry
  * module.dockerhub_mirror.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"]
* Delete
  * google_artifact_registry_repository.docker_cache
  * google_artifact_registry_repository.dockerhub_mirror
  * google_artifact_registry_repository_iam_member.dockerhub_mirror_access



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.docker_cache will be destroyed
  # (because google_artifact_registry_repository.docker_cache is not in configuration)
  - resource "google_artifact_registry_repository" "docker_cache" {
      - cleanup_policy_dry_run = false -> null
      - create_time            = "2022-10-11T11:19:45.542395Z" -> null
      - description            = "Cache repo for kyma-project" -> null
      - effective_labels       = {} -> null
      - format                 = "DOCKER" -> null
      - id                     = "projects/kyma-project/locations/europe/repositories/cache" -> null
      - labels                 = {} -> null
      - location               = "europe" -> null
      - mode                   = "STANDARD_REPOSITORY" -> null
      - name                   = "cache" -> null
      - project                = "kyma-project" -> null
      - repository_id          = "cache" -> null
      - terraform_labels       = {} -> null
      - update_time            = "2025-04-29T21:10:03.730207Z" -> null

      - cleanup_policies {
          - action = "DELETE" -> null
          - id     = "delete-untagged" -> null

          - condition {
              - package_name_prefixes = [] -> null
              - tag_prefixes          = [] -> null
              - tag_state             = "UNTAGGED" -> null
              - version_name_prefixes = [] -> null
            }
        }
      - cleanup_policies {
          - action = "DELETE" -> null
          - id     = "delete-old-cache" -> null

          - condition {
              - older_than            = "604800s" -> null
              - package_name_prefixes = [] -> null
              - tag_prefixes          = [] -> null
              - tag_state             = "ANY" -> null
              - version_name_prefixes = [] -> null
            }
        }

      - docker_config {
          - immutable_tags = false -> null
        }
    }

  # google_artifact_registry_repository.dockerhub_mirror will be destroyed
  # (because google_artifact_registry_repository.dockerhub_mirror is not in configuration)
  - resource "google_artifact_registry_repository" "dockerhub_mirror" {
      - cleanup_policy_dry_run = false -> null
      - create_time            = "2024-10-31T09:26:30.153692Z" -> null
      - description            = "Remote repository mirroring Docker Hub. For more details, see https://github.tools.sap/kyma/oci-image-builder/blob/main/README.md" -> null
      - effective_labels       = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - format                 = "DOCKER" -> null
      - id                     = "projects/sap-kyma-prow/locations/europe/repositories/dockerhub-mirror" -> null
      - labels                 = {} -> null
      - location               = "europe" -> null
      - mode                   = "REMOTE_REPOSITORY" -> null
      - name                   = "dockerhub-mirror" -> null
      - project                = "sap-kyma-prow" -> null
      - repository_id          = "dockerhub-mirror" -> null
      - terraform_labels       = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - update_time            = "2024-10-31T09:26:30.153692Z" -> null

      - cleanup_policies {
          - action = "DELETE" -> null
          - id     = "cleanup-old-images" -> null

          - condition {
              - older_than            = "63072000s" -> null
              - package_name_prefixes = [] -> null
              - tag_prefixes          = [] -> null
              - tag_state             = "ANY" -> null
              - version_name_prefixes = [] -> null
            }
        }

      - remote_repository_config {
          - description                 = "Mirror of Docker Hub" -> null
          - disable_upstream_validation = false -> null

          - docker_repository {
              - public_repository = "DOCKER_HUB" -> null
            }
        }
    }

  # google_artifact_registry_repository_iam_member.dockerhub_mirror_access will be destroyed
  # (because google_artifact_registry_repository_iam_member.dockerhub_mirror_access is not in configuration)
  - resource "google_artifact_registry_repository_iam_member" "dockerhub_mirror_access" {
      - etag       = "BwYyZ9m2VqA=" -> null
      - id         = "projects/kyma-project/locations/europe/repositories/dockerhub-mirror/roles/artifactregistry.reader/serviceAccount:azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com" -> null
      - location   = "europe" -> null
      - member     = "serviceAccount:azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com" -> null
      - project    = "kyma-project" -> null
      - repository = "projects/kyma-project/locations/europe/repositories/dockerhub-mirror" -> null
      - role       = "roles/artifactregistry.reader" -> null
    }

  # module.docker_cache.google_artifact_registry_repository.artifact_registry will be created
  + resource "google_artifact_registry_repository" "artifact_registry" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "Cache repo for kyma-project"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "cache"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "cache"
          + "owner" = "neighbors"
          + "type"  = "development"
        }
      + location               = "europe"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "cache"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "cache"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-untagged"

          + condition {
              + older_than            = "3600s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "UNTAGGED"
              + version_name_prefixes = []
            }
        }

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.docker_cache.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "service_account_repoAdmin_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"
      + project    = "kyma-project"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.repoAdmin"
    }

  # module.dockerhub_mirror.google_artifact_registry_repository.artifact_registry will be created
  + resource "google_artifact_registry_repository" "artifact_registry" {
      + cleanup_policy_dry_run = true
      + create_time            = (known after apply)
      + description            = "Remote repository mirroring Docker Hub. For more details, see https://github.tools.sap/kyma/oci-image-builder/blob/main/README.md"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "dockerhub-mirror"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + labels                 = {
          + "name"  = "dockerhub-mirror"
          + "owner" = "neighbors"
          + "type"  = "development"
        }
      + location               = "europe"
      + mode                   = "REMOTE_REPOSITORY"
      + name                   = (known after apply)
      + project                = "kyma-project"
      + repository_id          = "dockerhub-mirror"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "dockerhub-mirror"
          + "owner"                      = "neighbors"
          + "type"                       = "development"
        }
      + update_time            = (known after apply)

      + docker_config {
          + immutable_tags = false
        }

      + remote_repository_config {
          + description = "Remote repository mirroring Docker Hub"

          + docker_repository {
              + public_repository = "DOCKER_HUB"
            }

          + upstream_credentials {
              + username_password_credentials {
                  + password_secret_version = "docker_sap_org_service_auth_token"
                  + username                = "sapcom"
                }
            }
        }
    }

  # module.dockerhub_mirror.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"] will be created
  + resource "google_artifact_registry_repository_iam_member" "service_account_repoAdmin_access" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "europe"
      + member     = "serviceAccount:kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com"
      + project    = "kyma-project"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.repoAdmin"
    }

Plan: 4 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ artifact_registry                              = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2025-04-25T08:10:39.264911Z" -> "2025-04-29T12:27:38.182119Z"
                # (18 unchanged attributes hidden)
            }
        }
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry has changed
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id                     = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name                   = "modules-internal"
      ~ update_time            = "2025-04-25T08:10:39.264911Z" -> "2025-04-29T12:27:38.182119Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dev_kyma_modules.google_artifact_registry_repository.artifact_registry has changed
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id                     = "projects/kyma-project/locations/europe/repositories/dev-kyma-modules"
        name                   = "dev-kyma-modules"
      ~ update_time            = "2025-04-25T07:30:17.095593Z" -> "2025-04-29T11:51:22.079460Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":12929,"Program":"tfcmt","SHA1":"9f3acb5796ac25b7cdc291c17a9410b14e608577","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->